package edu.lzit.variable;
/*变量：程序中，用来存储单个数据的容器
    变量是存储数据的小空间 不是里面的数据
        比如：时间网速电量*/
/*
 * 变量的定义格式
 *   数据类型 变量名 = 数据值;
 *   int a = 10;
 * a为小空间起的名字 10在空间里的数值 =等号赋值 分号语句的结束
 * 数据类型：为空间中存储的数据加入类型限制
 * */
public class VariableDemo1 {
    public static void main(String[] args) {
        /*微信余额0元
         * 支付宝余额10元
         * 银行卡余额20元
         * 问题1请问现在一共有多少钱
         * 问题2微信收了10元红包，又发了2元红包，余额多少
         */

        //1.定义一个变量记录微信的余额
        double a = 0;
        //2.定义一个变量记录支付宝的余额
        double b = 10;
        //3.定义一个变量记录银行卡的余额
        double c = 20;
        //4.输出现在一共多少钱？
        System.out.println("现在一共多少钱？" + (a + b + c));
        //5.微信收了10块红包
        //原来的余额+10元=新的余额
        //让变量a记录新的余额
        a = a + 10;
        //执行过程
        //1.计算a+10，此时变量a里面记录的是0  0+10 得到结果10
        //2.把结果10赋值给变量a，此地变量原本的记录a就被覆盖了
        a = a - 2;
        System.out.println(a);

    }
}
