package edu.lzit.variable;

public class VariableSummary {

    /*
    小结
    1.定义格式
        数据类型 变量名 = 数据值；
    2.使用变量
        *输出打印
        *参与设计
        *修改记录的值
    3.使用场景
        某个数据经常发生改变
    4。注意事项
        变量名不能重复
        使用前一定要赋值
        变量只能存在一个值
        一条语句可定义和赋值多个
   */
            /*
            计算机的存储规则（数字）
            1.计算机中任何数据都是以二进制的形式来存储的
            2.在计算机中不同类型的数据有不同的存储单元
            计算机的存储单元
            字节  计算机存储数据的最小单位
            1字节 = 8bit位
            int 占4个字节 32位

            */



}
